[![imagenes/pythonista.png](imagenes/pythonista.png)](https://pythonista.io)

In [1]:
import pandas as pd
import numpy as np

## El dataframe ilustrativo.

El siguiente dataframe describe un censo poblacional de animmales en diversas regiones geocráficas.

In [2]:
poblacion = pd.DataFrame({'Animal':('lobo',
                                   'coyote',
                                   'jaguar',
                                   'cerdo salvaje',
                                    'tapir',
                                    'venado',
                                    'ocelote',
                                    'puma'),
                         'Norte_I':(12,
                                   np.NAN,
                                    None,
                                    2,
                                    4,
                                    2,
                                    14,
                                    5
                                   ),
                          'Norte_II':(23,
                                    4,
                                    25,
                                    21,
                                    9,
                                    121,
                                    1,
                                    2
                                   ),
                         'Centro_I':(15,
                                    23,
                                    2,
                                    120,
                                    40,
                                    121,
                                    0,
                                    5),
                         'Sur_I':(28,
                                  46,
                                  14,
                                  156,
                                  79,
                                  12,
                                  2,
                                  np.NAN)}).set_index('Animal')

In [3]:
poblacion

               Norte_I  Norte_II  Centro_I  Sur_I
Animal
lobo              12.0        23        15   28.0
coyote             NaN         4        23   46.0
jaguar             NaN        25         2   14.0
cerdo salvaje      2.0        21       120  156.0
tapir              4.0         9        40   79.0
venado             2.0       121       121   12.0
ocelote           14.0         1         0    2.0
puma               5.0         2         5    NaN

## El atributo *values*.

In [ ]:
poblacion.values

## El método *head()*

Regresa los primeros *n* renglones de un objeto de Pandas.

```
<objeto de Pandas>.head(<n>)
```

In [ ]:
poblacion.head(3)

## El método *tail()*.

Regresa los últimos *n* renglones de un objeto de Pandas.

```
<objeto de Pandas>.tail(<n>)
```

In [ ]:
poblacion.tail(4)

## El método *nsmallest()*.

Regresa un número indicado de *n* renglones con los valores más pequeños de una o varias columnas de un objeto de Pandas.

```
<objeto de Pandas>.nsmallest(<n>, columms=[<columnas>])
```

In [ ]:
poblacion.nsmallest(3, columns='Norte_I')

In [ ]:
poblacion.nsmallest(3, columns=['Norte_I', 'Sur_I'])

## El método *nlargest()*

Regresa un número indicado de *n* renglones con los valores más grandes de una o varias columnas de un objeto de Pandas.

```
<objeto de Pandas>.nsmallest(<n>, columms=[<columnas>])
```

In [ ]:
poblacion.nlargest(3, columns='Sur_I')

In [ ]:
poblacion.nlargest(3, columns=['Sur_I', 'Norte_I'])

## El método *isin()* .

Regresa otro objeto con contenidos booleanos indicando si el elemento del  objeto original se encuentra dentro de un iterable dado como argumento.
```
<objeto de Pandas>.isin(<iterable>)
```

In [ ]:
poblacion.isin(range(20,31))

In [ ]:
especies = pd.DataFrame({'Animal':('lobo',
                                   'coyote',
                                   'jaguar'),
                         'Norte_I':('estable',
                                   'amenzado',
                                'amenazado'),
                          'Norte_II':('estable',
                                    'estable',
                                    'extinto'),
                         'Centro_I':('estable',
                                    'amenazado',
                                    'extinto'),
                         'Sur_I':('amenazado',
                                  'extinto',
                                  'estable')}).set_index('Animal')

In [ ]:
especies

In [ ]:
especies.isin(['amenazado', 'extinto'])

## El método *diff()*.

Calcula la diferencia entre un elemento previo.

```
<objeto de Pandas>.diff(axis=<eje>)
```

In [ ]:
poblacion

In [ ]:
poblacion.diff()

In [ ]:
poblacion

In [ ]:
poblacion.diff(axis=1)

## El método  *eval()*.

Ese método evalúa expresiones que se ingresan como cadenas de catacteres y qeu implican a las columnas de un DataFrame.

```
<objeto de Pandas>.eval('<expresion>')
```

In [ ]:
poblacion.eval("Norte_I + Norte_II")

In [ ]:
poblacion_erronea = pd.DataFrame({'Animal':('lobo',
                                   'coyote',
                                   'jaguar',
                                   'cerdo salvaje',
                                    'tapir',
                                    'venado',
                                    'ocelote',
                                    'puma'),
                         'Norte-I':(12,
                                   np.NAN,
                                    None,
                                    2,
                                    4,
                                    2,
                                    14,
                                    5
                                   ),
                          'Norte-II':(23,
                                    4,
                                    25,
                                    21,
                                    9,
                                    121,
                                    1,
                                    2
                                   ),
                         'Centro-I':(15,
                                    23,
                                    2,
                                    120,
                                    40,
                                    121,
                                    0,
                                    5),
                         'Sur-I':(28,
                                  46,
                                  14,
                                  156,
                                  79,
                                  12,
                                  2,
                                  np.NAN)}).set_index('Animal')

In [ ]:
poblacion.eval("Norte-I + Norte-II")

In [ ]:
poblacion.eval("Norte = Norte_I + Norte_II")

In [ ]:
poblacion

Al utilizar el argumento *inplace=True*, el resultado de la expresión es añadido al objeto original.

In [ ]:
poblacion.eval("Norte = Norte_I + Norte_II", inplace=True)

In [ ]:
poblacion

## El método *take()*.

 Este método va a obtener los renglones que se indiquen en función de un índice numérico.
 
 
 ```
 <objeto de Pandas>.take(<colección de índices numéricos>)
 ```

In [ ]:
poblacion.take([1,4])

In [ ]:
poblacion.take(range(2,7,2))

## El método *replace()*.

Este método sustituye un valor a que coincida con uno de los valores dados como argumento.

 ```
 <objeto de Pandas>.relace(<colección de valores>, <valor de sustitución>)
 ```

In [ ]:
poblacion.replace(np.NaN, 0)

In [ ]:
poblacion.replace([0, np.NaN], 'extinto')

## El método *assign()*.

Crea una columna que contendrá los datros resultantes de una función.
```
<objeto de Pandas>.assign(<Identificador de columna>=<función>)
```

In [ ]:
poblacion.assign(Sureste=poblacion['Sur_I'] * .5)

In [ ]:
poblacion.assign(Sureste=lambda x: x['Sur_I'] * .5)

## El método *update()*.

Este método combinará 2 dataframes. Sólo va a sustituir los elemento que ya existan.

In [ ]:
especies

In [ ]:
otras_especies = pd.DataFrame({'Animal':('lobo',
                                   'antilope',
                                   'tucán'),
                         'Norte_I':('estable',
                                   'estable',
                                   'estable'),
                          'Norte_II':('extinto',
                                    'estable',
                                    'estable'),
                         'Centro_I':('estable',
                                    'estable',
                                    'estable'),
                         'Sur_I':('estable',
                                  'estable',
                                  'estable')}).set_index('Animal')

In [ ]:
otras_especies

In [ ]:
especies.update(otras_especies)

In [ ]:
especies

## El metodo *all()*.

Ese método se aplica para validar si todos los elementos de una columna (*axis=0*) o renglón (*axis=1*) son *True*.

```
<objeto>.all(axis=<n>)
```

In [4]:
poblacion

               Norte_I  Norte_II  Centro_I  Sur_I
Animal
lobo              12.0        23        15   28.0
coyote             NaN         4        23   46.0
jaguar             NaN        25         2   14.0
cerdo salvaje      2.0        21       120  156.0
tapir              4.0         9        40   79.0
venado             2.0       121       121   12.0
ocelote           14.0         1         0    2.0
puma               5.0         2         5    NaN

In [5]:
poblacion > 0

               Norte_I  Norte_II  Centro_I  Sur_I
Animal
lobo              True      True      True   True
coyote           False      True      True   True
jaguar           False      True      True   True
cerdo salvaje     True      True      True   True
tapir             True      True      True   True
venado            True      True      True   True
ocelote           True      True     False   True
puma              True      True      True  False

In [6]:
(poblacion > 0).all()

Norte_I     False
Norte_II     True
Centro_I    False
Sur_I       False
dtype: bool

In [7]:
(poblacion > 0).all(axis=1)

Animal
lobo              True
coyote           False
jaguar           False
cerdo salvaje     True
tapir             True
venado            True
ocelote          False
puma             False
dtype: bool

* Python toma como *True* a cualquier valor distinto de 0.

In [8]:
poblacion.all()

Norte_I      True
Norte_II     True
Centro_I    False
Sur_I        True
dtype: bool

## El método *any()*.

Ese método se aplica para validar si al menos un elemento de una columna (*axis=0*) o renglón (*axis-1*) es *True*.

```
<objeto>.any(axis=<n>)
```

In [9]:
(poblacion > 0).any()

Norte_I     True
Norte_II    True
Centro_I    True
Sur_I       True
dtype: bool

In [10]:
(poblacion > 0).any(axis=1)

Animal
lobo             True
coyote           True
jaguar           True
cerdo salvaje    True
tapir            True
venado           True
ocelote          True
puma             True
dtype: bool

## El método *items()*.

Este método crea un generador, el cual regresa tuplas de 2 elementos a partir de un  objeto de Pandas.

### El método *items()* en dataframes.
* En el caso de un dataframe, el generador regresa tuplas compiestas por los datos de cada columna con la siguiente estructura:

```
('<identificador de encabezado>', <objeto tipo pd.Series>)
```

### El método *items()* en series.
* En el caso de una serie, el generador regresa tuplas con la siguiente estructura:

```
('<identificador de índice>', <valor>)
```

In [11]:
poblacion.items()

In [14]:
for item in poblacion.items():
    print(item[0])
    print(item[1])

Norte_I
Animal
lobo             12.0
coyote            NaN
jaguar            NaN
cerdo salvaje     2.0
tapir             4.0
venado            2.0
ocelote          14.0
puma              5.0
Name: Norte_I, dtype: float64
Norte_II
Animal
lobo              23
coyote             4
jaguar            25
cerdo salvaje     21
tapir              9
venado           121
ocelote            1
puma               2
Name: Norte_II, dtype: int64
Centro_I
Animal
lobo              15
coyote            23
jaguar             2
cerdo salvaje    120
tapir             40
venado           121
ocelote            0
puma               5
Name: Centro_I, dtype: int64
Sur_I
Animal
lobo              28.0
coyote            46.0
jaguar            14.0
cerdo salvaje    156.0
tapir             79.0
venado            12.0
ocelote            2.0
puma               NaN
Name: Sur_I, dtype: float64

In [16]:
for i in poblacion.items():
    print(i[0])
    for j in i[1].items():
        print(j)

Norte_I
('lobo', 12.0)
('coyote', nan)
('jaguar', nan)
('cerdo salvaje', 2.0)
('tapir', 4.0)
('venado', 2.0)
('ocelote', 14.0)
('puma', 5.0)
Norte_II
('lobo', 23)
('coyote', 4)
('jaguar', 25)
('cerdo salvaje', 21)
('tapir', 9)
('venado', 121)
('ocelote', 1)
('puma', 2)
Centro_I
('lobo', 15)
('coyote', 23)
('jaguar', 2)
('cerdo salvaje', 120)
('tapir', 40)
('venado', 121)
('ocelote', 0)
('puma', 5)
Sur_I
('lobo', 28.0)
('coyote', 46.0)
('jaguar', 14.0)
('cerdo salvaje', 156.0)
('tapir', 79.0)
('venado', 12.0)
('ocelote', 2.0)
('puma', nan)

## El método *drop()*.

Elimina los identficadores de los índices (*axis=0*) o columnas (*axis=1*) localizados dentro de una colección ingresada como argumento.
```
<objeto de Pandas>.drop(<colección de identificadores>, axis=<n>)
```

In [20]:
poblacion

               Norte_I  Norte_II  Centro_I  Sur_I
Animal
lobo              12.0        23        15   28.0
coyote             NaN         4        23   46.0
jaguar             NaN        25         2   14.0
cerdo salvaje      2.0        21       120  156.0
tapir              4.0         9        40   79.0
venado             2.0       121       121   12.0
ocelote           14.0         1         0    2.0
puma               5.0         2         5    NaN

In [21]:
poblacion.drop(['Centro_I'], axis=1)

               Norte_I  Norte_II  Sur_I
Animal
lobo              12.0        23   28.0
coyote             NaN         4   46.0
jaguar             NaN        25   14.0
cerdo salvaje      2.0        21  156.0
tapir              4.0         9   79.0
venado             2.0       121   12.0
ocelote           14.0         1    2.0
puma               5.0         2    NaN

In [22]:
poblacion.drop(['lobo', 'tapir'])

               Norte_I  Norte_II  Centro_I  Sur_I
Animal
coyote             NaN         4        23   46.0
jaguar             NaN        25         2   14.0
cerdo salvaje      2.0        21       120  156.0
venado             2.0       121       121   12.0
ocelote           14.0         1         0    2.0
puma               5.0         2         5    NaN

## El método *combine()*.

In [24]:
take_smaller = lambda s1, s2: s1 if s1.sum() < s2.sum() else s2

In [25]:
df1 = pd.DataFrame({'A': [0, 0], 'B': [None, 4]})

In [27]:
df1

   A    B
0  0  NaN
1  0  4.0

In [26]:
df2 = pd.DataFrame({'A': [1, 1], 'B': [None, 3]})

In [28]:
df2

   A    B
0  1  NaN
1  1  3.0

In [29]:
 df1.combine(df2, take_smaller)

   A    B
0  0  NaN
1  0  3.0

## El método *insert()*.

Este métodi insertárá una columna en la posición que se le indique.

```
<objeto de Pandas>.insert(<posición numérica>. <nombre de columna>, <valores>)
```

In [ ]:
poblacion.insert(4, 'Sur_II', [7, 21, 23, 6, 11, 32, 21, 1])

<p style="text-align: center"><a rel="license" href="http://creativecommons.org/licenses/by/4.0/"><img alt="Licencia Creative Commons" style="border-width:0" src="https://i.creativecommons.org/l/by/4.0/80x15.png" /></a><br />Esta obra está bajo una <a rel="license" href="http://creativecommons.org/licenses/by/4.0/">Licencia Creative Commons Atribución 4.0 Internacional</a>.</p>
<p style="text-align: center">&copy; José Luis Chiquete Valdivieso. 2019.</p>